s18/dacs-receive/SampleHttpRequest.txt

POST /services/wdx/wdx.svc/apikey HTTP/1.1
Content-Type: text/xml; charset=utf-8
SOAPAction: "http://schemas.mobilengine.com/Wdx/IWdx/EnqueueDacs"
Host: localhost:8080
Content-Length: 503
Expect: 100-continue
Accept-Encoding: gzip, deflate
Connection: Keep-Alive

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <EnqueueDacs xmlns="http://schemas.mobilengine.com/Wdx">
            <dacs dacsid="4e2531d5-6d2d-4dc9-91c1-64a780c044e9" dtu="2019-09-16T09:09:25.3681392Z" meta="hello-dacs">
                <Key>bd745b006cc44c7998c9a1824bbd0d6d</Key>
                <Content>
                    <Hello Message="alma" xmlns="http://schemas.acme.com/HelloWorld" />
                </Content>
            </dacs>
        </EnqueueDacs>
    </s:Body>
</s:Envelope>